# SELECT Statement

### In this notebook we study some use case examples for the SELECT statment.

We first call the pandas and psycopg2 libraries

In [20]:
import pandas as pd
import psycopg2 as pg2

Now let's create an engine instance giving the create_engine function the database URL as argument

In [21]:
connection = pg2.connect(database = 'dvdrental', user = 'postgres', password = 'password')

In [26]:
def get_data(query):

    with connection.cursor() as cursor:
        cursor. execute(query_1)
        raw_data = cursor.fetchmany(10) 
        col_names = [col_desc[0] for col_desc in cursor.description]
        data = pd.DataFrame(raw_data, columns = col_names)

    return data

## Ex. 1

As our first example, we'll ask for the whole actor table form the database. At the end of the cell we display the first ten rows of the table.

In [22]:
query_1 = 'SELECT * FROM actor'

with connection.cursor() as cursor:
    cursor. execute(query_1)
    raw_data = cursor.fetchmany(10) 
    col_names = [col_desc[0] for col_desc in cursor.description]
    actor_table = pd.DataFrame(raw_data, columns = col_names)

actor_table

   actor_id first_name     last_name             last_update
0         1   Penelope       Guiness 2013-05-26 14:47:57.620
1         2       Nick      Wahlberg 2013-05-26 14:47:57.620
2         3         Ed         Chase 2013-05-26 14:47:57.620
3         4   Jennifer         Davis 2013-05-26 14:47:57.620
4         5     Johnny  Lollobrigida 2013-05-26 14:47:57.620
5         6      Bette     Nicholson 2013-05-26 14:47:57.620
6         7      Grace        Mostel 2013-05-26 14:47:57.620
7         8    Matthew     Johansson 2013-05-26 14:47:57.620
8         9        Joe         Swank 2013-05-26 14:47:57.620
9        10  Christian         Gable 2013-05-26 14:47:57.620

## Ex. 2

We can grab only a subset of columns out of the table.

In [23]:
query_2 = 'SELECT first_name, actor_id FROM actor'

with connection.cursor() as cursor:
    cursor. execute(query_2)
    raw_data = cursor.fetchmany(10) 
    col_names = [col_desc[0] for col_desc in cursor.description]
    two_columns = pd.DataFrame(raw_data, columns = col_names)

two_columns

  first_name  actor_id
0   Penelope         1
1       Nick         2
2         Ed         3
3   Jennifer         4
4     Johnny         5
5      Bette         6
6      Grace         7
7    Matthew         8
8        Joe         9
9  Christian        10

## Ex 3.

It may be the case that we'd like to list only the distinct vlaues in a certain column, we can use the DISTINCT keyword to fullfil this task. Suppose we'd want to know the different categories of the movies that are in the film database, to respond to this question we can use the following code

In [24]:
query_3 = 'SELECT DISTINCT(name) FROM category'

with connection.cursor() as cursor:
    cursor. execute(query_3)
    raw_data = cursor.fetchmany(10) 
    col_names = [col_desc[0] for col_desc in cursor.description]
    movie_categories = pd.DataFrame(raw_data, columns = col_names)

movie_categories

          name
0       Family
1        Games
2    Animation
3  Documentary
4     Classics
5       Sports
6          New
7     Children
8        Music
9       Travel

# COUNT Function 

The count function simply returns back the number of rows in a table.

## Ex. 4

Using the COUNT function we can calculate how many movies are in our database.

In [25]:
query_4 = 'SELECT COUNT(film_id) FROM film'

with connection.cursor() as cursor:
    cursor. execute(query_4)
    raw_data = cursor.fetchmany(10) 
    col_names = [col_desc[0] for col_desc in cursor.description]
    amount_movies = pd.DataFrame(raw_data, columns = col_names)

amount_movies

   count
0   1000